[
    {
        "quote": "My experience is that Australian Credit Solution is very good, and it’s easy and quick.",
        "author": "jimmy",
        "image": "https://cdn.productreview.com.au/resize/avatar/9b2bb893-bc29-306f-b1f6-14bd5163820a?width=128&height=128",
        "date": "68 days ago",
        "rating": 5,
        "position": "Property Manager"
    },
    {
        "quote": "Fantastic service! Angelie was incredibly helpful throughout the process, and Vanessa kept me updated every step of the way. I’m really happy with the result—highly recommended!",
        "author": "Heather King",
        "image": "https://cdn.productreview.com.au/resize/avatar/950431bb-50a7-33eb-b3e6-b58191288c37?width=128&height=128",
        "date": "11 days ago",
        "rating": 5,
        "position": "Hotel Manager"
    },
    {
        "quote": "Amazing work, guys—thank you so much! Special thanks to Vanessa and Angelie for all your help and support. I truly appreciate everything you’ve done!",
        "author": "Subash K.",
        "image": "https://cdn.productreview.com.au/resize/avatar/c0d67a3b-dbe0-30c8-ada2-22051ef5c181?width=128&height=128",
        "date": "40 days ago",
        "rating": 5,
        "position": "Single Parent"
    },
    {
        "quote": "Sheina, Angelie, and the entire ACS team have been incredible. The whole process was quick, smooth, and handled with so much professionalism and care. I’m truly satisfied with the services and deeply grateful for their support. This experience has made me very happy—thank you for everything!",
        "author": "Thomas O.",
        "image": "https://cdn.productreview.com.au/resize/avatar/96667d89-8d9c-39fd-8264-840ae531b172?width=128&height=128",
        "date": "11 days ago",
        "rating": 5,
        "position": "Photographer"
    },
    {
        "quote": "Thank you, guys, for informing me! It was amazing, and I truly love how you work. I appreciate all your help and effort!",
        "author": "Kyra C.",
        "image": "https://cdn.productreview.com.au/resize/avatar/19a35137-d875-390a-9d2c-b6f34c6745fa?width=128&height=128",
        "date": "87 days ago",
        "rating": 5,
        "position": "Teacher"
    },
    {
        "quote": "Angelie and Sheina, along with the whole ACS team, were truly amazing. Their professionalism, warmth, and dedication made me feel well taken care of from start to finish. I’m very happy with the service and deeply appreciate the effort and support they provided. They are a great company to work with!",
        "author": "Francis Luis Siogase",
        "image": "https://cdn.productreview.com.au/resize/avatar/af1ccb86-1936-36f0-adf7-d38630fd19b6?width=128&height=128",
        "date": "17 days ago",
        "rating": 5,
        "position": "Auto Dealer"
    },
    {
        "quote": "Sheina and the entire ACS team were truly amazing. They worked with such dedication, professionalism, and care, making the whole experience smooth and stress-free. I’m deeply grateful for their hard work and support, and I couldn’t be more satisfied with the service they provided. Thank you for going above and beyond!",
        "author": "J D WilliAms",
        "image": "https://cdn.productreview.com.au/resize/avatar/2e868c8e-61ac-3749-972c-5b9d9b0685ef?width=128&height=128",
        "date": "25 days ago",
        "rating": 5,
        "position": "Student"
    },
    {
        "quote": "My experience with Australian Credit Solution has been amazing! They were able to remove my default in just 1 day, and now my WRHI is clear. I’m so excited to finally move forward with my car loan. Highly recommend their fast and professional service!",
        "author": "Udit M",
        "image": "https://cdn.productreview.com.au/resize/avatar/73ece401-8e34-33bd-8aaf-b8b40d29c7fb?width=128&height=128",
        "date": "26 days ago",
        "rating": 5,
        "position": "IT Consultant"
    },
    {
        "quote": "Thank you—it was all good, and I truly appreciate the help!",
        "author": "Rohit Kumar",
        "image": "https://cdn.productreview.com.au/resize/avatar/294b400a-339e-3dfd-8a2a-9b36285c9037?width=128&height=128",
        "date": "75 days ago",
        "rating": 5,
        "position": "Nurse"
    },
    {
        "quote": "Hi I want share my successful story I have previously 3- default and 20 inquiries and my score dropped down to 320. I am very upset. I did apply any loans. I haven’t got it due to this inquiries. I reach Australian credit solution. They help me out within two months now I have clear my all default and inquiriesI am happy my Creditscore now 875 thanks Vanessa Anjali all Australian credit solution staff thank you very much. I heavily recommendation",
        "author": "HARJOT SANDHU",
        "image": "https://ui-avatars.com/api/?name=HARJOT%20SANDHU&background=00BCD4&size=75&color=ffffff&rounded=1&format=png",
        "date": "71 days ago",
        "rating": 5,
        "position": "Self-Employed Consultant"
    },
    {
        "quote": "My experience with Australian Credit Solutions was excellent! The process was very smooth and fast. A big thank you to Daisy and Angelie for their amazing support and assistance they made everything so much easier. Highly recommend their service!",
        "author": "Thai",
        "image": "https://cdn.productreview.com.au/resize/avatar/a62a705b-9633-3799-9902-bc8a124f96cf?width=128&height=128",
        "date": "74 days ago",
        "rating": 5,
        "position": "Event Planner"
    },
    {
        "quote": "I am really happy with the service I received from ACS! The team especially my adviser Karla with Daisy, and Kristine were amazing. They were very responsive, kept me updated throughout the process, and acted quickly to have my default and RHI removed. Honestly, I highly recommend ACS to anyone needing help. I will definitely refer them to my friends!",
        "author": "Keerthi",
        "image": "https://cdn.productreview.com.au/resize/avatar/b3105ee0-814e-3128-a8f0-f7696e4b97cd?width=128&height=128",
        "date": "77 days ago",
        "rating": 5,
        "position": "Sales Representative"
    },
    {
        "quote": "Amazing—thank you, everyone, for your incredible support! I’m truly happy with the outcome. A special thanks Vanessa for clearly guiding me through the process and keeping me updated. I’m so grateful for all your efforts—you’ve made a real difference!",
        "author": "Amiir B.",
        "image": "https://cdn.productreview.com.au/resize/avatar/48281b32-11d6-3f3d-a439-311aed58853c?width=128&height=128",
        "date": "45 days ago",
        "rating": 5,
        "position": "Warehouse Associate"
    },
    {
        "quote": "The customer service team is excellent! Very friendly, professional, and always willing to help. They made the whole process smooth and easy. I truly appreciate the support and positive attitude of the team. Highly recommended!",
        "author": "Russell",
        "image": "https://cdn.productreview.com.au/resize/avatar/21aba9c1-9c78-3098-a656-200b7ca0d47c?width=128&height=128",
        "date": "84 days ago",
        "rating": 5,
        "position": "Construction Worker"
    },
    {
        "quote": "Thank you so much for informing me—it was so good to hear the result! I’m beyond happy and honestly feel like celebrating. This means so much to me after everything I’ve been through.",
        "author": "Raphael C.",
        "image": "https://cdn.productreview.com.au/resize/avatar/4f3b4aa8-d2c7-3812-95c3-e7df30fe0904?width=128&height=128",
        "date": "32 days ago",
        "rating": 5,
        "position": "Rideshare Driver"
    },
    {
        "quote": "Kristine and the team have been incredibly helpful and professional. They’re honest, fast, and really know what they’re doing. Everything was handled smoothly and without any delays. I truly appreciate how quick and transparent their service is. Highly recommended!",
        "author": "Jason Poore",
        "image": "https://cdn.productreview.com.au/resize/avatar/e2a71df1-0b20-38c9-8e80-0eb806c40af2?width=128&height=128",
        "date": "41 days ago",
        "rating": 5,
        "position": "Veteran"
    },
    {
        "quote": "Guys, you’re so amazing—I’m honestly overwhelmed by the result! Thank you for keeping me updated and for guiding me through the whole process. I never expected things to turn out this well, and I’m truly grateful for all your hard work, patience, and support. You’ve given me peace of mind and a fresh start. I can’t thank you enough!",
        "author": "Raphael C.",
        "image": "https://cdn.productreview.com.au/resize/avatar/4f3b4aa8-d2c7-3812-95c3-e7df30fe0904?width=128&height=128",
        "date": "30 days ago",
        "rating": 5,
        "position": "Construction Worker"
    },
    {
        "quote": "Angie was so helpful and reassuring through what could have been a very stressful time. She stayed in contact and kept me update throughout the whole process. I highly recommend dealing with Angie to help resolve any issues you may have. Thanks for making it such a smooth and easy experience.",
        "author": "David Purves",
        "image": "https://ui-avatars.com/api/?name=David%20Purves&background=00BCD4&size=75&color=ffffff&rounded=1",
        "date": "52 days ago",
        "rating": 5,
        "position": "Retail Store Manager"
    },
    {
        "quote": "Very helpful people just share everything they will help as much as they can",
        "author": "Ranjeetliteneasy02",
        "image": "https://ui-avatars.com/api/?name=Ranjeetliteneasy02&background=E91E63&size=75&color=ffffff&rounded=1",
        "date": "77 days ago",
        "rating": 5,
        "position": "Handyman"
    },
    {
        "quote": "I’m very happy with the service so far. Kristine and Angelie have been great—both very helpful and responsive. They’ve made the process smooth and easy, and I appreciate their support throughout. Excellent service overall!",
        "author": "Gavin",
        "image": "https://cdn.productreview.com.au/resize/avatar/753f93cb-b98d-3f7a-ad1d-db15851e6170?width=128&height=128",
        "date": "73 days ago",
        "rating": 5,
        "position": "Plumber"
    },
    {
        "quote": "am very satisfied with the service I received. Every time I needed assistance, the team was quick to respond and kept me well updated. Angelie and Kristine, in particular, have been incredibly responsive and helpful. As a student, I truly appreciate their understanding and support, especially when it comes to financial matters. They always take the time to explain the work they’ve done, which gives me peace of mind. A solid 10/10 from me!",
        "author": "Muhammad",
        "image": "https://cdn.productreview.com.au/resize/avatar/51492baa-8cf9-3b8b-863c-c8037f4c071b?width=128&height=128",
        "date": "58 days ago",
        "rating": 5,
        "position": "Construction Worker"
    },
    {
        "quote": "My experience with Australian Credit Solutions has been excellent so far. The team has been professional, supportive, and attentive to my concerns every step of the way. They truly understand credit issues and offer practical solutions. I’m hopeful everything will be sorted out by Monday, and I appreciate all their help up to this point. Highly recommended for anyone needing help with their credit file!",
        "author": "Dylan E.",
        "image": "https://cdn.productreview.com.au/resize/avatar/980687dc-5d6b-3ebd-bdc4-cc55abd066ad?width=128&height=128",
        "date": "62 days ago",
        "rating": 5,
        "position": "Nurse"
    },
    {
        "quote": "Sheina did a great job assisting the client—thank you so much, Sheina! I also want to extend my thanks to the entire ACS team for the excellent support. Truly appreciated!",
        "author": "Kelera R.",
        "image": "https://cdn.productreview.com.au/resize/avatar/c3659dce-9bdc-393e-8a37-6dcb96cf3926?width=128&height=128",
        "date": "6 days ago",
        "rating": 5,
        "position": "Electrician"
    },
    {
        "quote": "Good and truly marvelous experience—thank you so much! The support I received was beyond my expectations. Angelie was excellent in helping me with my loan, guiding me with patience and care. Vanessa kept me updated every step of the way and made sure I understood the process clearly. I’m so grateful for everything you’ve done. Highly recommended!",
        "author": "Eshan",
        "image": "https://cdn.productreview.com.au/resize/avatar/7ae4d493-94a5-3766-8f39-02815df7b0d5?width=128&height=128",
        "date": "68 days ago",
        "rating": 5,
        "position": "Handyman"
    },
    {
        "quote": "My experience with Australian Credit Solutions has been truly excellent. From the beginning, their team was supportive, professional, and genuinely committed to helping me with my credit issues.",
        "author": "Sushanth",
        "image": "https://cdn.productreview.com.au/resize/avatar/07000868-b0c8-3c02-83b6-99784fb5596d?width=128&height=128",
        "date": "68 days ago",
        "rating": 5,
        "position": "Auto Dealer"
    },
    {
        "quote": "My experience with Australian Credit Solution has been a long journey, but it was absolutely worth it. They guided me every step of the way, and in the end, the results were better than I expected. Their team was professional, supportive, and truly committed to achieving the best possible outcome. I'm really happy with the service – highly recommended!",
        "author": "Ravindra",
        "image": "https://cdn.productreview.com.au/resize/avatar/5e866c54-7bb2-32fe-a830-0fa4b242b643?width=128&height=128",
        "date": "41 days ago",
        "rating": 5,
        "position": "Handyman"
    },
    {
        "quote": "The team at ACS has truly helped me so much, and I couldn’t be more grateful. I was so happy with the support I received—absolutely 5 out of 5! Everything was handled with care and professionalism. Sheina, thank you from the bottom of my heart. You made a big difference, and I deeply appreciate it.",
        "author": "Hoang Phuc Nguyen",
        "image": "https://cdn.productreview.com.au/resize/avatar/11a49b4e-583c-3414-86f0-04d5095ee873?width=128&height=128",
        "date": "71 days ago",
        "rating": 5,
        "position": "Event Planner"
    },
    {
        "quote": "Thank you so much, guys! We didn’t expect things to move this fast! Big thanks to Angelie for being so patient with us, and to Vanessa for keeping us updated about the result. We truly appreciate all your help!",
        "author": "Desmond Panapa Peseta",
        "image": "https://cdn.productreview.com.au/resize/avatar/bcfc387c-22df-3f8a-b9c5-6889e9e53f10?width=128&height=128",
        "date": "11 days ago",
        "rating": 5,
        "position": "Barber/Salon Owner"
    },
    {
        "quote": "Angelie, Sheina, and the entire ACS team were very good. They were supportive, professional, and made the whole process smooth and easy. I truly appreciate their help!",
        "author": "Krishant K.",
        "image": "https://cdn.productreview.com.au/resize/avatar/b7ff3d98-4fc1-4756-ae14-ff9c99236070?width=128&height=128",
        "date": "35 days ago",
        "rating": 5,
        "position": "Pharmacy Tech"
    },
    {
        "quote": "Angelie, Sheina, and the entire ACS team were very good. Everything went smoothly, and I’m really happy with the outcome. Thank you for the excellent support!",
        "author": "Hanif Karimi",
        "image": "https://cdn.productreview.com.au/resize/avatar/e4e2ad8f-8bad-3b18-92f7-a4910fe02da2?width=128&height=128",
        "date": "76 days ago",
        "rating": 5,
        "position": "Truck Driver"
    }
]